import React from "react";

export const Terms = () => {
  return (
    <div className="layout-no-sidebar">
      <div className="container-no-sidebar legal">
        <div className="pt-legal">
          <h2>利用規約</h2>
          <p>
            この利用規約（以下、「本規約」といいます。）は、TechPut
            （以下、「本サービス」といいます。）の提供条件および本サービスの利用に関するお客様とTechPut運営（以下、「運営者」といいます。）との間の権利義務関係を定めるものです。本サービスをご利用いただくには、本規約に同意いただく必要があります。
          </p>
        </div>
        <div className="pt-legal">
          <h3>第1条（適用）</h3>
          <p>本規約は、本サービスの利用に関する一切の関係に適用されるものとします。</p>
          <p>
            運営者は本サービスに関し、本規約のほか、利用に関するルール等（以下「個別規定」といいます。）を定めることがあります。個別規定は本規約の一部を構成するものとします。
          </p>
        </div>
        <div className="pt-legal">
          <h3>第2条（利用登録）</h3>
          <p>
            登録希望者が運営者の定める方法によって利用登録を申請し、運営者がこれを承認することによって、利用登録が完了するものとします。
          </p>
          <p>
            運営者は、利用登録の申請者に以下の事由があると判断した場合、登録を拒否することがあります。
          </p>
        </div>
        <div className="pt-legal">
          <h3>第3条（ユーザーIDおよびパスワードの管理）</h3>
          <p>ユーザーは、自己の責任においてユーザーIDおよびパスワードを管理するものとします。</p>
          <p>ユーザーIDとパスワードの不正使用により生じた損害は、運営者は一切責任を負いません。</p>
        </div>
        <div className="pt-legal">
          <h3>第4条（禁止事項）</h3>
          <p>ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。</p>
          <ul>
            <li>・法令または公序良俗に違反する行為</li>
            <li>・犯罪行為に関連する行為</li>
            <li>・本サービスの内容等の無断転載・複製・再配布</li>
            <li>・他のユーザーまたは第三者への誹謗中傷・プライバシー侵害</li>
            <li>・運営者または他のユーザーに不利益・損害を与える行為</li>
            <li>・その他、運営者が不適切と判断する行為</li>
          </ul>
        </div>
        <div className="pt-legal">
          <h3>第5条（投稿内容の取り扱い）</h3>
          <p>
            ユーザーが投稿したコンテンツ（文章・画像・その他データ）は、ユーザー自身の責任において行われるものとします。
          </p>
          <p>
            運営者は、ユーザーの投稿内容が法令または本規約に違反すると判断した場合、予告なく削除することがあります。
          </p>
        </div>
        <div className="pt-legal">
          <h3>第6条（著作権）</h3>
          <p>
            ユーザーが投稿したコンテンツの著作権は、原則としてユーザーに帰属します。ただし、ユーザーは運営者に対し、運営者が本サービスの運営・広報等の目的で投稿内容を無償で利用（複製、公開、翻訳等）することを許諾するものとします。
          </p>
        </div>
        <div className="pt-legal">
          <h3>第7条（免責事項）</h3>
          <p>運営者は、本サービスの内容の正確性、完全性、有用性について保証しません。</p>
          <p>
            運営者は、ユーザー間または第三者との間において生じたトラブルについて、一切の責任を負いません。
          </p>
        </div>
        <div className="pt-legal">
          <h3>第8条（サービス内容の変更等）</h3>
          <p>
            運営者は、ユーザーに事前に通知することなく、本サービスの内容を変更、または提供を中止することができます。
          </p>
        </div>
        <div className="pt-legal">
          <h3>第9条（利用規約の変更）</h3>
          <p>
            運営者は、必要と判断した場合には、ユーザーに通知することなく、いつでも本規約を変更することができます。
          </p>
        </div>
        <div className="pt-legal">
          <h3>第10条（準拠法・裁判管轄）</h3>
          <p>
            本サービスに関して紛争が生じた場合には、運営者の所在地を管轄する裁判所を第一審の専属的合意管轄裁判所とします。
          </p>
        </div>
        <div className="pt-legal mb-10">
          <h3>
            制定日：<span className="font-normal">2025年4月25日</span>
          </h3>
        </div>
      </div>
    </div>
  );
};
